#Installing SQL

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.8 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [ ]:
%load_ext sql

#Create Database

In [ ]:
%%sql
sqlite:///stud_db.db

#Populating the Database

In [ ]:
%%sql
--- Personal Details Data
CREATE TABLE personal_details (national_ID INTEGER(15) PRIMARY KEY,
                               stud_ID VARCHAR(15),
                               stud_name VARCHAR(100),
                               phone_number VARCHAR(15),
                               age INTEGER,
                               gender VARCHAR(10)
                              );

INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender) VALUES
                             ("265834","stud101","Creed Bratton" ,"0712345678",20,"Male"),
                             ("567903","stud102","Dwight Schrute" ,"0723456781",21,"Male"),
                             ("478403","stud103","Darryl Philbin" ,"0734567812",22,"Male"),
                             ("266302","stud104","Ryan Howard" ,"0745678123",19,"Male"),
                             ("988781","stud105","Phyllis Vance" ,"0756781234",21,"Female"),
                             ("307243","stud106","Stanley Hudson" ,"0767812345",21,"Male"),
                             ("366932","stud107","Cece Halperk" ,"0778123456",22,"Female"),
                             ("598920","stud108","Davina Wallace" ,"0781234567",20,"Female"),
                             ("789261","stud109","Jim Halpert" ,"0722345678",20,"Male"),
                             ("339152","stud110","Pam Beesly" ,"0733456781",21,"Female"),
                             ("339746","stud111","Oscar Martinez" ,"0744567812",20,"Male"),
                             ("336373","stud112","Kelly Kapoor" ,"0755678123",22,"Female"),
                             ("325252","stud113","Jan Levinson" ,"0766456781",21,"Female"),
                             ("321746","stud114","Angela Martins" ,"0741367812",20,"Male"),
                             ("390234","stud115","Michael Scott" ,"0744421123",22,"Female");

 * sqlite:///stud_db.db
Done.
15 rows affected.

[]

In [ ]:
%%sql
--- School Details Data
CREATE TABLE school_details (stud_ID VARCHAR(15) PRIMARY KEY,
                             current_home_county VARCHAR(20),
                             secondary_school_county VARCHAR(20),
                             residence VARCHAR(15),
                             stud_email VARCHAR(50)
                            );

INSERT INTO school_details (stud_ID)
SELECT stud_ID
FROM personal_details;

UPDATE school_details
SET stud_email = (SELECT (REPLACE (stud_name,' ','') || '@zinduaschool.ac')
					        FROM personal_details
					        WHERE school_details.stud_ID = personal_details.stud_ID) ;

UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db.db
Done.
15 rows affected.
15 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
--- Contact Details Data
CREATE TABLE contact_details (stud_email VARCHAR(50) PRIMARY KEY,
                              phone_number VARCHAR(15),
                              next_of_kin_name VARCHAR(50),
                              next_of_kin_relation VARCHAR(10),
                              next_of_kin_contacts VARCHAR(13)
                             );
INSERT INTO contact_details (phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts) VALUES
                            ("0712345678","Papa Jones","Father","0782382383"),
                            ("0723456781","Vera Sidika","Mother","0723238983"),
                            ("0734567812","Zari Hassan","Mother","0779343126"),
                            ("0745678123","Diamond Platnumz","Father","0798246347"),
                            ("0756781234","Obi Abel","Father","0711234453"),
                            ("0767812345","Timothee Chamgei","Father","0765439233"),
                            ("0778123456","Tupac Biggie","Father","0702526243"),
                            ("0781234567","Blac Chyna","Mother","0747282839"),
                            ("0722345678","Beyonce Knowles","Mother","0753927482"),
                            ("0733456781","Kanye West","Father","0713245748"),
                            ("0744567812","Baba Yake","Father","0725737383"),
                            ("0755678123","Steve Carell","Father","0789346276"),
                            ("0766456781","Holly Sadden","Mother","0785739259"),
                            ("0741367812","Grace Kibunjia","Mother","0791344537"),
                            ("0755421123","Mum Momo","Mother","0765748244");

UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
                  FROM school_details, personal_details
                  WHERE school_details.stud_ID = personal_details.stud_ID
                  AND personal_details.phone_number = contact_details.phone_number
                 );

 * sqlite:///stud_db.db
Done.
15 rows affected.
15 rows affected.

[]

In [ ]:
%%sql
--- Financial Details Data
CREATE TABLE IF NOT EXISTS financial_details (stud_ID VARCHAR(15) PRIMARY KEY,
                                stud_name VARCHAR(50),
                                sem_fee INTEGER(6),
                                fee_paid INTEGER(6)
                               );

INSERT INTO financial_details (stud_ID, stud_name)
            SELECT personal_details.stud_ID, personal_details.stud_name
            FROM personal_details;

UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db.db
Done.
15 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#new_stud_details
Using JOIN get the student names, school id, email, phone number

In [ ]:
%%sql
--- New Student Details Data
CREATE TABLE IF NOT EXISTS new_stud_details (stud_id varchar(15),
                                             stud_name varchar(20),
                                             email varchar(30),
                                             phone_number INTEGER
                                            );

 * sqlite:///stud_db.db
Done.

[]

In [ ]:
%%sql
INSERT INTO new_stud_details (stud_id, stud_name, email, phone_number)
            SELECT pd.stud_id, pd.stud_name, sd.stud_email, pd.phone_number
            FROM personal_details pd
            JOIN school_details sd
            ON sd.stud_id =pd.stud_id

 * sqlite:///stud_db.db
15 rows affected.

[]

In [ ]:
%%sql
SELECT *
FROM new_stud_details;

 * sqlite:///stud_db.db
Done.

[('stud101', 'Creed Bratton', 'CreedBratton@zinduaschool.ac', 712345678),
 ('stud102', 'Dwight Schrute', 'DwightSchrute@zinduaschool.ac', 723456781),
 ('stud103', 'Darryl Philbin', 'DarrylPhilbin@zinduaschool.ac', 734567812),
 ('stud104', 'Ryan Howard', 'RyanHoward@zinduaschool.ac', 745678123),
 ('stud105', 'Phyllis Vance', 'PhyllisVance@zinduaschool.ac', 756781234),
 ('stud106', 'Stanley Hudson', 'StanleyHudson@zinduaschool.ac', 767812345),
 ('stud107', 'Cece Halperk', 'CeceHalperk@zinduaschool.ac', 778123456),
 ('stud108', 'Davina Wallace', 'DavinaWallace@zinduaschool.ac', 781234567),
 ('stud109', 'Jim Halpert', 'JimHalpert@zinduaschool.ac', 722345678),
 ('stud110', 'Pam Beesly', 'PamBeesly@zinduaschool.ac', 733456781),
 ('stud111', 'Oscar Martinez', 'OscarMartinez@zinduaschool.ac', 744567812),
 ('stud112', 'Kelly Kapoor', 'KellyKapoor@zinduaschool.ac', 755678123),
 ('stud113', 'Jan Levinson', 'JanLevinson@zinduaschool.ac', 766456781),
 ('stud114', 'Angela Martins', 'AngelaMartins@zinduaschool.ac', 741367812),
 ('stud115', 'Michael Scott', 'MichaelScott@zinduaschool.ac', 744421123)]

#(full_stud_details)
Create a table with all the details from contacts to school and financial details

In [ ]:
%%sql
--- Full Student Details Data
CREATE TABLE full_stud_details (stud_ID VARCHAR(15),
                                stud_name VARCHAR(100),
                                stud_email VARCHAR(50),
                                phone_number VARCHAR(15),
                                current_home_county VARCHAR(20),
                                secondary_school_county VARCHAR(20),
                                residence VARCHAR(15),
                                sem_fee INTEGER(6),
                                fee_paid INTEGER(6),
                                next_of_kin_name VARCHAR(50),
                                next_of_kin_relation VARCHAR(10),
                                next_of_kin_contacts VARCHAR(13)
                               );

INSERT INTO full_stud_details (stud_ID,
                               stud_name,
                               stud_email,
                               phone_number,
                               current_home_county,
                               secondary_school_county,
                               residence,
                               sem_fee,
                               fee_paid,
                               next_of_kin_relation,
                               next_of_kin_name,
                               next_of_kin_contacts)


SELECT s.stud_id ,f.stud_name,s.stud_email, c.phone_number, c.next_of_kin_name, c.next_of_kin_relation, c.next_of_kin_contacts,
       s.current_home_county, s.secondary_school_county, s.residence,
       f.sem_fee, f.fee_paid
FROM contact_details c
JOIN school_details s
ON c.stud_email = s.stud_email
JOIN financial_details f
ON s.stud_id = f.stud_id;



SELECT s.stud_id ,f.stud_name,s.stud_email, c.phone_number, c.next_of_kin_name, c.next_of_kin_relation, c.next_of_kin_contacts,
       s.current_home_county, s.secondary_school_county, s.residence,
       f.sem_fee, f.fee_paid
FROM contact_details c
JOIN school_details s
ON c.stud_email = s.stud_email
JOIN financial_details f
ON s.stud_id = f.stud_id;

 * sqlite:///stud_db.db
Done.
14 rows affected.
Done.

[('stud101', 'Creed Bratton', 'CreedBratton@zinduaschool.ac', '0712345678', 'Papa Jones', 'Father', '0782382383', 'Nakuru', 'Nairobi', 'In school', 25000, 25000),
 ('stud102', 'Dwight Schrute', 'DwightSchrute@zinduaschool.ac', '0723456781', 'Vera Sidika', 'Mother', '0723238983', 'Nairobi', 'Nakuru', 'In school', 25000, 19000),
 ('stud103', 'Darryl Philbin', 'DarrylPhilbin@zinduaschool.ac', '0734567812', 'Zari Hassan', 'Mother', '0779343126', 'Samburu', 'Nairobi', 'Out of school', 21900, 20000),
 ('stud104', 'Ryan Howard', 'RyanHoward@zinduaschool.ac', '0745678123', 'Diamond Platnumz', 'Father', '0798246347', 'Kericho', 'Nairobi', 'In school', 22000, 22000),
 ('stud105', 'Phyllis Vance', 'PhyllisVance@zinduaschool.ac', '0756781234', 'Obi Abel', 'Father', '0711234453', 'Nyamira', 'Nakuru', 'In school', 25000, 23400),
 ('stud106', 'Stanley Hudson', 'StanleyHudson@zinduaschool.ac', '0767812345', 'Timothee Chamgei', 'Father', '0765439233', 'Kisumu', 'Nairobi', 'Out of school', 25000, 27000),
 ('stud107', 'Cece Halperk', 'CeceHalperk@zinduaschool.ac', '0778123456', 'Tupac Biggie', 'Father', '0702526243', 'Nakuru', 'Nairobi', 'Out of school', 24230, 21200),
 ('stud108', 'Davina Wallace', 'DavinaWallace@zinduaschool.ac', '0781234567', 'Blac Chyna', 'Mother', '0747282839', 'Kisumu', 'Mombasa', 'Out of school', 25000, 23500),
 ('stud109', 'Jim Halpert', 'JimHalpert@zinduaschool.ac', '0722345678', 'Beyonce Knowles', 'Mother', '0753927482', 'Kericho', 'Mombasa', 'In school', 25000, 24500),
 ('stud110', 'Pam Beesly', 'PamBeesly@zinduaschool.ac', '0733456781', 'Kanye West', 'Father', '0713245748', 'Nakuru', 'Mombasa', 'In school', 25000, 25000),
 ('stud111', 'Oscar Martinez', 'OscarMartinez@zinduaschool.ac', '0744567812', 'Baba Yake', 'Father', '0725737383', 'Kiambu', 'Turkana', 'In school', 26000, 26000),
 ('stud112', 'Kelly Kapoor', 'KellyKapoor@zinduaschool.ac', '0755678123', 'Steve Carell', 'Father', '0789346276', 'Nairobi', 'Nakuru', 'In school', 25000, 20900),
 ('stud113', 'Jan Levinson', 'JanLevinson@zinduaschool.ac', '0766456781', 'Holly Sadden', 'Mother', '0785739259', 'Samburu', 'Taita Taveta', 'In school', 25000, 22300),
 ('stud114', 'Angela Martins', 'AngelaMartins@zinduaschool.ac', '0741367812', 'Grace Kibunjia', 'Mother', '0791344537', 'Kericho', 'Nairobi', 'Out of school', 19000, 19000)]

#Add student names on any empty row of stud_name in financial_details

In [ ]:
%%sql
INSERT INTO financial_details (stud_name) VALUES ('Coco Jones');

 * sqlite:///stud_db.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO financial_details (stud_name) VALUES ('Nyashinski Kamau');

 * sqlite:///stud_db.db
1 rows affected.

[]

#(financial_details_view)
On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not

In [ ]:
%%sql
ALTER TABLE financial_details
ADD fee_cleared

 * sqlite:///stud_db.db
Done.

[]

In [ ]:
%%sql
UPDATE financial_details
SET fee_cleared='True'
WHERE sem_fee=fee_paid;

 * sqlite:///stud_db.db
6 rows affected.

[]

In [ ]:
%%sql
UPDATE financial_details
SET fee_cleared='False'
WHERE fee_paid<sem_fee;

 * sqlite:///stud_db.db
8 rows affected.

[]

In [ ]:
%%sql
SELECT*
FROM financial_details;

 * sqlite:///stud_db.db
Done.

[('stud101', 'Creed Bratton', 25000, 25000, 'True'),
 ('stud102', 'Dwight Schrute', 25000, 19000, 'False'),
 ('stud103', 'Darryl Philbin', 21900, 20000, 'False'),
 ('stud104', 'Ryan Howard', 22000, 22000, 'True'),
 ('stud105', 'Phyllis Vance', 25000, 23400, 'False'),
 ('stud106', 'Stanley Hudson', 25000, 27000, None),
 ('stud107', 'Cece Halperk', 24230, 21200, 'False'),
 ('stud108', 'Davina Wallace', 25000, 23500, 'False'),
 ('stud109', 'Jim Halpert', 25000, 24500, 'False'),
 ('stud110', 'Pam Beesly', 25000, 25000, 'True'),
 ('stud111', 'Oscar Martinez', 26000, 26000, 'True'),
 ('stud112', 'Kelly Kapoor', 25000, 20900, 'False'),
 ('stud113', 'Jan Levinson', 25000, 22300, 'False'),
 ('stud114', 'Angela Martins', 19000, 19000, 'True'),
 ('stud115', 'Michael Scott', 20800, 20800, 'True'),
 (None, 'Coco Jones', None, None, None),
 (None, 'Nyashinski Kamau', None, None, None)]

#(fee_cleared)
Get the national ID and name of all students who have cleared their fees

In [ ]:
%%sql
SELECT DISTINCT pd.national_id,fd.stud_name,fd.fee_cleared
FROM personal_details pd, financial_details fd
JOIN personal_details
ON pd.stud_name=fd.stud_name
WHERE fee_cleared='True';

 * sqlite:///stud_db.db
Done.

[(321746, 'Angela Martins', 'True'),
 (265834, 'Creed Bratton', 'True'),
 (390234, 'Michael Scott', 'True'),
 (339746, 'Oscar Martinez', 'True'),
 (339152, 'Pam Beesly', 'True'),
 (266302, 'Ryan Howard', 'True')]

#(total_fee_balance)
Get the total sum of fees paid so far and the total current deficit

In [ ]:
%%sql
SELECT sum(sem_fee)-sum(fee_paid)as total_fee_balance
FROM financial_details;

 * sqlite:///stud_db.db
Done.

[(19330,)]

#(home_county_count)
Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties

In [ ]:
%%sql
SELECT count(stud_id) as home_county_county,
       current_home_county
FROM school_details
GROUP BY current_home_county;

 * sqlite:///stud_db.db
Done.

[(3, 'Kericho'),
 (2, 'Kiambu'),
 (2, 'Kisumu'),
 (2, 'Nairobi'),
 (3, 'Nakuru'),
 (1, 'Nyamira'),
 (2, 'Samburu')]

#(secondary_school_count)
Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [ ]:
%%sql
SELECT DISTINCT pd.gender, sd.secondary_school_county,count(pd.gender) as secondary_school_count
FROM school_details sd,
     personal_details pd
LEFT JOIN personal_details
ON pd.stud_id=sd.stud_id
GROUP BY pd.gender,sd.secondary_school_county;

 * sqlite:///stud_db.db
Done.

[('Female', 'Mombasa', 70),
 ('Female', 'Nairobi', 56),
 ('Female', 'Nakuru', 49),
 ('Female', 'Taita Taveta', 21),
 ('Female', 'Turkana', 7),
 ('Male', 'Mombasa', 46),
 ('Male', 'Nairobi', 118),
 ('Male', 'Nakuru', 38),
 ('Male', 'Taita Taveta', 8),
 ('Male', 'Turkana', 22)]

#(kin_percentage)
Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1.

In [ ]:
%%sql
SELECT count(next_of_kin_relation) as kin_percentage
FROM contact_details
WHERE next_of_kin_relation='Mother'
GROUP BY next_of_kin_relation;

 * sqlite:///stud_db.db
Done.

[(7,)]

In [ ]:
%%sql
SELECT count(next_of_kin_relation) as kin_percentage
FROM contact_details
WHERE next_of_kin_relation='Father'
GROUP BY next_of_kin_relation;

 * sqlite:///stud_db.db
Done.

[(8,)]